; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 101291 2 1 2 8 4
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	image1 - mode
	spectrograph0 - mode
	Star0 - direction
	GroundStation3 - direction
	GroundStation5 - direction
	GroundStation6 - direction
	Star7 - direction
	Star1 - direction
	Star2 - direction
	GroundStation4 - direction
	Star8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Planet11 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 image1)
	(calibration_target instrument0 Star2)
	(calibration_target instrument0 Star1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
	(supports instrument1 image1)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 GroundStation4)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon10)
)
(:goal (and
	(pointing satellite1 GroundStation4)
	(have_image Star8 image1)
	(have_image Planet9 image1)
	(have_image Phenomenon10 image1)
	(have_image Planet11 image1)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 5
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 5
3. (turn_to satellite0 star8 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star8)
   goals met: 0 of 5
4. (turn_to satellite1 groundstation4 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 groundstation4)
   goals met: 1 of 5
5. (calibrate satellite1 instrument1 groundstation4)
   added: (calibrated instrument1)
   goals met: 1 of 5
6. (turn_to satellite0 planet9 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 planet9)
   goals met: 1 of 5
7. (turn_to satellite1 star8 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 star8)
   goals met: 0 of 5
8. (turn_to satellite0 planet11 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 planet11)
   goals met: 0 of 5
9. (take_image satellite1 star8 instrument1 image1)
   added: (have_image star8 image1)
   goals met: 1 of 5
10. (turn_to satellite0 phenomenon10 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 phenomenon10)
   goals met: 1 of 5
11. (turn_to satellite1 planet9 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 planet9)
   goals met: 1 of 5
12. (turn_to satellite0 star1 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 star1)
   goals met: 1 of 5
13. (take_image satellite1 planet9 instrument1 image1)
   added: (have_image planet9 image1)
   goals met: 2 of 5
14. (calibrate satellite0 instrument0 star1)
   added: (calibrated instrument0)
   goals met: 2 of 5
15. (turn_to satellite1 groundstation4 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 groundstation4)
   goals met: 3 of 5
16. (turn_to satellite0 planet11 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 planet11)
   goals met: 3 of 5
17. (take_image satellite0 planet11 instrument0 image1)
   added: (have_image planet11 image1)
   goals met: 4 of 5
18. (turn_to satellite1 phenomenon10 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 phenomenon10)
   goals met: 3 of 5
19. (take_image satellite1 phenomenon10 instrument1 image1)
   added: (have_image phenomenon10 image1)
   goals met: 4 of 5
20. (turn_to satellite1 groundstation4 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 groundstation4)
   goals met: 5 of 5
